In [1]:
import pandas as pd
import os

In [2]:
data = pd.read_csv(os.path.join('data','vehicle_collisions.csv'), parse_dates = [1])

In [3]:
data.columns

Index([u'UNIQUE KEY', u'DATE', u'TIME', u'BOROUGH', u'ZIP CODE', u'LATITUDE',
       u'LONGITUDE', u'LOCATION', u'ON STREET NAME', u'CROSS STREET NAME',
       u'OFF STREET NAME', u'PERSONS INJURED', u'PERSONS KILLED',
       u'PEDESTRIANS INJURED', u'PEDESTRIANS KILLED', u'CYCLISTS INJURED',
       u'CYCLISTS KILLED', u'MOTORISTS INJURED', u'MOTORISTS KILLED',
       u'VEHICLE 1 TYPE', u'VEHICLE 2 TYPE', u'VEHICLE 3 TYPE',
       u'VEHICLE 4 TYPE', u'VEHICLE 5 TYPE', u'VEHICLE 1 FACTOR',
       u'VEHICLE 2 FACTOR', u'VEHICLE 3 FACTOR', u'VEHICLE 4 FACTOR',
       u'VEHICLE 5 FACTOR'],
      dtype='object')

In [6]:
data['DATE'] = [i.to_datetime() for i in data['DATE']]

In [9]:
data['year']=[i.year for i in data['DATE']]

In [10]:
data['year-month']=["{0}-{1}".format(i.year,i.month) for i in data['DATE']]

In [12]:
data_2016 = data[data['year']==2016]

In [14]:
total_number_collissions_2016 = data_2016['UNIQUE KEY'].count()

In [20]:
data_2016.groupby('year-month').count()['BOROUGH']

year-month
2016-1     13954
2016-10    12225
2016-11    12004
2016-12    11964
2016-2     12173
2016-3     13976
2016-4     14042
2016-5     14182
2016-6     12496
2016-7     12974
2016-8     12235
2016-9     12081
Name: BOROUGH, dtype: int64

In [24]:
data_2016[data_2016['BOROUGH']=='MANHATTAN'].groupby(['year-month','BOROUGH',]).count()
print ""

In [28]:
data_required = pd.DataFrame({'MONTH':['Jan','Feb','Mar','Apr','May','Jun','Jul','Aug','spe','Oct','Nov','Dec'],
'MANHATTAN':range(12),'NYC':range(12),'PERCENTAGE':range(12)
	})
data_required['MANHATTAN']=data_2016[data['BOROUGH']=="MANHATTAN"].groupby('year-month').count()['BOROUGH'].values
data_required['NYC']=data_2016.groupby('year-month').count()['BOROUGH'].values
data_required['PERCENTAGE'] = (data_required['MANHATTAN']/data_required['NYC'])*100

C:\Users\samba\Anaconda2\lib\site-packages\ipykernel\__main__.py:4: UserWarning: Boolean Series key will be reindexed to match DataFrame index.

In [29]:
data_required

    MANHATTAN MONTH    NYC  PERCENTAGE
0        3178   Jan  13954   22.774832
1        2831   Feb  12225   23.157464
2        2838   Mar  12004   23.642119
3        2634   Apr  11964   22.016048
4        3195   May  12173   26.246611
5        3479   Jun  13976   24.892673
6        3540   Jul  14042   25.210084
7        3432   Aug  14182   24.199690
8        2956   spe  12496   23.655570
9        3055   Oct  12974   23.547094
10       2844   Nov  12235   23.244790
11       2744   Dec  12081   22.713352

In [30]:
data.head(1)

,UNIQUE KEY,DATE,TIME,BOROUGH,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,...,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR,year,year-month
0,3146911,2015-01-01,0:20,QUEENS,11358.0,40.751847,-73.787862,"(40.7518471, -73.787862)",47 AVENUE,193 STREET,...,NaN,NaN,NaN,TRAFFIC CONTROL DISREGARDED,NaN,NaN,NaN,NaN,2015,2015-1

In [37]:
bouroughs = data['BOROUGH'].unique()
bouroughs_length = len(bouroughs)
data_required = pd.DataFrame({'BOROUGH':bouroughs,'ONE_VEHICLE_INVOLVED':range(bouroughs_length),
                             'TWO_VEHICLE_INVOLVED':range(bouroughs_length),
                              'THREE_VEHICLE_INVOLVED':range(bouroughs_length),
                              'MORE_VEHICLE_INVOLVED':range(bouroughs_length)
                             })
data['year']=[i.year for i in data['DATE']]
data_gt_2015 = data[data['year']>=2015]
one_vehicle_count

In [36]:
data_required

,BOROUGH,MORE_VEHICLE_INVOLVED,ONE_VEHICLE_INVOLVED,THREE_VEHICLE_INVOLVED,TWO_VEHICLE_INVOLVED
0,QUEENS,0,0,0,0
1,NaN,1,1,1,1
2,BROOKLYN,2,2,2,2
3,MANHATTAN,3,3,3,3
4,BRONX,4,4,4,4
5,STATEN ISLAND,5,5,5,5

In [38]:
data_gt_2015.groupby('BOROUGH').count()

,UNIQUE KEY,DATE,TIME,ZIP CODE,LATITUDE,LONGITUDE,LOCATION,ON STREET NAME,CROSS STREET NAME,OFF STREET NAME,...,VEHICLE 3 TYPE,VEHICLE 4 TYPE,VEHICLE 5 TYPE,VEHICLE 1 FACTOR,VEHICLE 2 FACTOR,VEHICLE 3 FACTOR,VEHICLE 4 FACTOR,VEHICLE 5 FACTOR,year,year-month
BOROUGH,,,,,,,,,,,,,,,,,,,,,
BRONX,24884,24884,24884,24884,20549,20549,20549,17480,17480,7370,...,1335,347,101,24652,20882,1441,372,106,24884,24884
BROOKLYN,54142,54142,54142,54138,45336,45336,45336,40036,40036,14099,...,3297,815,233,53466,45812,3540,887,247,54142,54142
MANHATTAN,41105,41105,41105,41103,34666,34666,34666,31576,31577,9525,...,1190,291,72,40529,35198,1340,333,87,41105,41105
QUEENS,47187,47187,47187,47157,38604,38604,38604,34176,34176,12963,...,3104,797,171,46766,40694,3301,846,185,47187,47187
STATEN ISLAND,7709,7709,7709,7709,6480,6480,6480,5941,5941,1768,...,469,94,15,7659,6667,496,102,17,7709,7709

In [39]:
data['year']=[i.year for i in data['DATE']]
data_gt_2015 = data[data['year']>=2015]
data_required = data_gt_2015.groupby('BOROUGH').count()

In [ ]:
data_required = pd.DataFrame({'BOROUGH':data_required['BOROUGH'],'ONE_VEHICLE_INVOLVED':data_required[''],
                             'TWO_VEHICLE_INVOLVED':data_required[''],
                              'THREE_VEHICLE_INVOLVED':data_required[''],
                              'MORE_VEHICLE_INVOLVED':data_required['']
                             })